<?xml version="1.0"?>
<net name="main_graph" version="11">
	<layers>
		<layer id="0" name="input" type="Parameter" version="opset1">
			<data shape="1,60,42,2" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="input">
					<dim>1</dim>
					<dim>60</dim>
					<dim>42</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="onnx::Expand_945_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 61, 42" offset="0" size="5124" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>61</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="onnx::Expand_945" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>61</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Expand_945">
					<dim>1</dim>
					<dim>61</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="/Constant_4" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="5124" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_4_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="/Constant_5" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="5132" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_5_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="/Constant_6" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="5140" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_6_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="/Constant_3" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="5148" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_3_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="/Slice" type="Slice" version="opset8">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>60</dim>
					<dim>42</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="/Slice_output_0">
					<dim>1</dim>
					<dim>60</dim>
					<dim>21</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="ShapeOf_10793" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>60</dim>
					<dim>21</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Constant_10794" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="5124" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Constant_10795" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="5124" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="11" name="Gather_10796" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/model1/Gather_4_output_0,/model1/Unsqueeze_3_output_0,/model1/Unsqueeze_4_output_0,/model1/Unsqueeze_5_output_0,/model2/Gather_4_output_0,/model2/Unsqueeze_3_output_0,/model2/Unsqueeze_4_output_0,/model2/Unsqueeze_5_output_0,/model3/Gather_4_output_0,/model3/Unsqueeze_3_output_0,/model3/Unsqueeze_4_output_0,/model3/Unsqueeze_5_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="/model1/Constant_13" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="5156" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/model1/Constant_13_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="/model1/Constant_14" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="5156" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/model1/Constant_14_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="/model1/Concat_4" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="/model1/Concat_4_output_0,/model1/Reshape_3_output_0,/model2/Concat_4_output_0,/model2/Reshape_3_output_0,/model3/Concat_4_output_0,/model3/Reshape_3_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="/model1/Mul_2" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="5164" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/model1/Mul_2_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="/model1/Equal_1" type="Equal" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="/model1/Equal_1_output_0,/model2/Equal_1_output_0,/model3/Equal_1_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="/model1/ConstantOfShape_1" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="5188" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/model1/ConstantOfShape_1_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="/model1/Where_1" type="Select" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="BOOL">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="/model1/Where_1_output_0,/model2/Where_1_output_0,/model3/Where_1_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="/model1/Expand_1" type="Broadcast" version="opset3">
			<data mode="bidirectional" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>61</dim>
					<dim>42</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model1/Expand_1_output_0">
					<dim>1</dim>
					<dim>61</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="/model1/Constant_19" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="5124" size="8" />
			<output>
				<port id="0" precision="I64" names="/model1/Constant_19_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Constant_10816" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="5140" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Constant_10817" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="5124" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="23" name="Gather_10818" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/model1/Gather_5_output_0,/model2/Gather_5_output_0,/model3/Gather_5_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Constant_8315" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="5140" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="/model1/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/model1/Add_output_0,/model1/Unsqueeze_6_output_0,/model2/Add_output_0,/model2/Unsqueeze_6_output_0,/model3/Add_output_0,/model3/Unsqueeze_6_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="/model1/Constant_21" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="5140" size="8" />
			<output>
				<port id="0" precision="I64" names="/model1/Constant_21_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="/model1/Constant_18" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="5140" size="8" />
			<output>
				<port id="0" precision="I64" names="/model1/Constant_18_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="/model1/Slice" type="Slice" version="opset8">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>61</dim>
					<dim>42</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="/model1/Slice_output_0">
					<dim>1</dim>
					<dim>61</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="onnx::Expand_937_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 42" offset="5212" size="84" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="onnx::Expand_937" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Expand_937">
					<dim>1</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="/model1/Constant_7" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="5156" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/model1/Constant_7_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="/model1/Concat_1" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/model1/Concat_1_output_0,/model1/Reshape_1_output_0,/model2/Concat_1_output_0,/model2/Reshape_1_output_0,/model3/Concat_1_output_0,/model3/Reshape_1_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="/model1/Mul_1" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="5296" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/model1/Mul_1_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="/model1/Equal" type="Equal" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="/model1/Equal_output_0,/model2/Equal_output_0,/model3/Equal_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="/model1/ConstantOfShape" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="5312" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/model1/ConstantOfShape_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="/model1/Where" type="Select" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="BOOL">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="/model1/Where_output_0,/model2/Where_output_0,/model3/Where_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="/model1/Expand" type="Broadcast" version="opset3">
			<data mode="bidirectional" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>42</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model1/Expand_output_0">
					<dim>1</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Constant_10928" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="5328" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="/model1/Reshape_2" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>42</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model1/Reshape_2_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Constant_10929" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="5352" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="/model1/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>60</dim>
					<dim>21</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model1/Reshape_output_0">
					<dim>1</dim>
					<dim>60</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="/model1/Concat_3" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>42</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>60</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model1/Concat_3_output_0">
					<dim>1</dim>
					<dim>61</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="/model1/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>61</dim>
					<dim>42</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>61</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model1/Add_1_output_0">
					<dim>1</dim>
					<dim>61</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Constant_10155_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 126" offset="5376" size="252" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>126</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Constant_10155" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>126</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>126</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Transpose_9768_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="126, 42" offset="5628" size="10584" />
			<output>
				<port id="0" precision="FP16">
					<dim>126</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Transpose_9768" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>126</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>126</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="/model1/encoder/layers.0/self_attn/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>61</dim>
					<dim>42</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>126</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model1/encoder/layers.0/self_attn/MatMul_output_0">
					<dim>1</dim>
					<dim>61</dim>
					<dim>126</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="/model1/encoder/layers.0/self_attn/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>126</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>61</dim>
					<dim>126</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model1/encoder/layers.0/self_attn/Add_output_0">
					<dim>1</dim>
					<dim>61</dim>
					<dim>126</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Constant_10930" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="16212" size="32" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="/model1/encoder/layers.0/self_attn/Reshape_2" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>61</dim>
					<dim>126</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model1/encoder/layers.0/self_attn/Reshape_2_output_0">
					<dim>1</dim>
					<dim>61</dim>
					<dim>3</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="/model1/encoder/layers.0/self_attn/Constant_16" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="5124" size="8" />
			<output>
				<port id="0" precision="I64" names="/model1/encoder/layers.0/self_attn/Constant_16_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="/model1/encoder/layers.0/self_attn/Unsqueeze_1" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>61</dim>
					<dim>3</dim>
					<dim>42</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model1/encoder/layers.0/self_attn/Unsqueeze_1_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>61</dim>
					<dim>3</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Constant_9580" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="5124" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Squeeze_9581" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>61</dim>
					<dim>3</dim>
					<dim>42</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>61</dim>
					<dim>3</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Constant_9582" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="16244" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="/model1/encoder/layers.0/self_attn/Squeeze_1" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>61</dim>
					<dim>3</dim>
					<dim>42</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model1/encoder/layers.0/self_attn/Squeeze_1_output_0">
					<dim>3</dim>
					<dim>1</dim>
					<dim>61</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="5124" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_output_0" />
			</output>
		</layer>
		<layer id="59" name="Constant_223" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="5124" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="60" name="/model1/encoder/layers.0/self_attn/Gather_3" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>1</dim>
					<dim>61</dim>
					<dim>42</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/model1/encoder/layers.0/self_attn/Gather_3_output_0">
					<dim>1</dim>
					<dim>61</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Constant_10931" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="16276" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="/model1/encoder/layers.0/self_attn/Reshape_3" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>61</dim>
					<dim>42</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model1/encoder/layers.0/self_attn/Reshape_3_output_0">
					<dim>1</dim>
					<dim>61</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Constant_283" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="16300" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="/model1/encoder/layers.0/self_attn/Transpose_1" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>61</dim>
					<dim>42</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model1/encoder/layers.0/self_attn/Transpose_1_output_0">
					<dim>61</dim>
					<dim>1</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Constant_10932" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="16324" size="32" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="/model1/encoder/layers.0/self_attn/Reshape_6" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>61</dim>
					<dim>1</dim>
					<dim>42</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model1/encoder/layers.0/self_attn/Reshape_6_output_0">
					<dim>61</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="/model1/encoder/layers.0/self_attn/Constant_26_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="16356" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="/model1/encoder/layers.0/self_attn/Constant_26" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model1/encoder/layers.0/self_attn/Constant_26_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="/model1/encoder/layers.0/self_attn/Shape_6" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>61</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/model1/encoder/layers.0/self_attn/Shape_6_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="/model1/encoder/layers.0/self_attn/Constant_24" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="5156" size="8" />
			<output>
				<port id="0" precision="I64" names="/model1/encoder/layers.0/self_attn/Constant_24_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="/model1/encoder/layers.0/self_attn/Constant_25" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="16358" size="8" />
			<output>
				<port id="0" precision="I64" names="/model1/encoder/layers.0/self_attn/Constant_25_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Broadcast_569" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="5140" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Constant_573" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="5124" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="/model1/encoder/layers.0/self_attn/Slice_3" type="Slice" version="opset8">
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="I64" names="/model1/encoder/layers.0/self_attn/Slice_3_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="/model1/encoder/layers.0/self_attn/Cast_2" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model1/encoder/layers.0/self_attn/Cast_2_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="/model1/encoder/layers.0/self_attn/Sqrt" type="Sqrt" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model1/encoder/layers.0/self_attn/Sqrt_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="/model1/encoder/layers.0/self_attn/Div_1" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model1/encoder/layers.0/self_attn/Cast_3_output_0,/model1/encoder/layers.0/self_attn/Div_1_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="/model1/encoder/layers.0/self_attn/Sqrt_1" type="Sqrt" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model1/encoder/layers.0/self_attn/Sqrt_1_output_0,/model1/encoder/layers.0/self_attn/Sqrt_2_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="/model1/encoder/layers.0/self_attn/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>61</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>42</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model1/encoder/layers.0/self_attn/Mul_output_0">
					<dim>61</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="/Constant_1" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="5140" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_1_output_0" />
			</output>
		</layer>
		<layer id="81" name="Constant_225" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="5124" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="82" name="/model1/encoder/layers.0/self_attn/Gather_4" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>1</dim>
					<dim>61</dim>
					<dim>42</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/model1/encoder/layers.0/self_attn/Gather_4_output_0">
					<dim>1</dim>
					<dim>61</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Constant_10933" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="16366" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="/model1/encoder/layers.0/self_attn/Reshape_4" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>61</dim>
					<dim>42</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model1/encoder/layers.0/self_attn/Reshape_4_output_0">
					<dim>1</dim>
					<dim>61</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Constant_9776" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="16390" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="/model1/encoder/layers.0/self_attn/Transpose_2" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>61</dim>
					<dim>42</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model1/encoder/layers.0/self_attn/Transpose_2_output_0">
					<dim>61</dim>
					<dim>1</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Constant_10934" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="16414" size="32" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="/model1/encoder/layers.0/self_attn/Reshape_7" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>61</dim>
					<dim>1</dim>
					<dim>42</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model1/encoder/layers.0/self_attn/Reshape_7_output_0">
					<dim>61</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Constant_9778" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="16446" size="32" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="/model1/encoder/layers.0/self_attn/Transpose_4" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>61</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>42</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model1/encoder/layers.0/self_attn/Transpose_4_output_0">
					<dim>61</dim>
					<dim>1</dim>
					<dim>42</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="/model1/encoder/layers.0/self_attn/Mul_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>61</dim>
					<dim>1</dim>
					<dim>42</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model1/encoder/layers.0/self_attn/Mul_1_output_0">
					<dim>61</dim>
					<dim>1</dim>
					<dim>42</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="/model1/encoder/layers.0/self_attn/MatMul_1" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>61</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>42</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>61</dim>
					<dim>1</dim>
					<dim>42</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model1/encoder/layers.0/self_attn/MatMul_1_output_0">
					<dim>61</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="/model1/encoder/layers.0/self_attn/Softmax" type="SoftMax" version="opset8">
			<data axis="-1" />
			<input>
				<port id="0" precision="FP32">
					<dim>61</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model1/encoder/layers.0/self_attn/Softmax_output_0">
					<dim>61</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="/Constant_2" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="5148" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_2_output_0" />
			</output>
		</layer>
		<layer id="95" name="Constant_227" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="5124" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="96" name="/model1/encoder/layers.0/self_attn/Gather_5" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>1</dim>
					<dim>61</dim>
					<dim>42</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/model1/encoder/layers.0/self_attn/Gather_5_output_0">
					<dim>1</dim>
					<dim>61</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Constant_10935" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="16366" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="/model1/encoder/layers.0/self_attn/Reshape_5" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>61</dim>
					<dim>42</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model1/encoder/layers.0/self_attn/Reshape_5_output_0">
					<dim>1</dim>
					<dim>61</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Constant_9782" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="16390" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="/model1/encoder/layers.0/self_attn/Transpose_3" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>61</dim>
					<dim>42</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model1/encoder/layers.0/self_attn/Transpose_3_output_0">
					<dim>61</dim>
					<dim>1</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Constant_10936" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="16414" size="32" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="/model1/encoder/layers.0/self_attn/Reshape_8" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>61</dim>
					<dim>1</dim>
					<dim>42</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model1/encoder/layers.0/self_attn/Reshape_8_output_0">
					<dim>61</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="/model1/encoder/layers.0/self_attn/MatMul_2" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>61</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>61</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model1/encoder/layers.0/self_attn/MatMul_2_output_0">
					<dim>61</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Constant_589" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="16244" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="/model1/encoder/layers.0/self_attn/Transpose_5" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>61</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>42</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model1/encoder/layers.0/self_attn/Transpose_5_output_0">
					<dim>1</dim>
					<dim>61</dim>
					<dim>1</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Concat_4138" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="16478" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="/model1/encoder/layers.0/self_attn/Reshape_9" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>61</dim>
					<dim>1</dim>
					<dim>42</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model1/encoder/layers.0/self_attn/Reshape_9_output_0">
					<dim>61</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="model1.encoder.layers.0.self_attn.out_proj.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="42, 42" offset="16494" size="3528" />
			<output>
				<port id="0" precision="FP16">
					<dim>42</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="model1.encoder.layers.0.self_attn.out_proj.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>42</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="model1.encoder.layers.0.self_attn.out_proj.weight">
					<dim>42</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="/model1/encoder/layers.0/self_attn/Gemm/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>61</dim>
					<dim>42</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>42</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>61</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Constant_10156_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 42" offset="20022" size="84" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Constant_10156" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="/model1/encoder/layers.0/self_attn/Gemm" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>61</dim>
					<dim>42</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model1/encoder/layers.0/self_attn/Gemm_output_0">
					<dim>61</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="/model1/encoder/layers.0/self_attn/Shape_3" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>61</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/model1/encoder/layers.0/self_attn/Concat_2_output_0,/model1/encoder/layers.0/self_attn/Concat_9_output_0,/model1/encoder/layers.0/self_attn/Shape_1_output_0,/model1/encoder/layers.0/self_attn/Shape_2_output_0,/model1/encoder/layers.0/self_attn/Shape_3_output_0,/model1/encoder/layers.0/self_attn/Shape_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="/model1/encoder/layers.0/self_attn/Reshape_10" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>61</dim>
					<dim>42</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model1/encoder/layers.0/self_attn/Reshape_10_output_0">
					<dim>1</dim>
					<dim>61</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="/model1/encoder/layers.0/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>61</dim>
					<dim>42</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>61</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model1/encoder/layers.0/Add_output_0">
					<dim>1</dim>
					<dim>61</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="Constant_617" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="5156" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="/model1/encoder/layers.0/norm1/Div" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>61</dim>
					<dim>42</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model1/encoder/layers.0/norm1/Div_output_0">
					<dim>1</dim>
					<dim>61</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="Constant_10157_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 42" offset="20106" size="84" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="Constant_10157" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="/model1/encoder/layers.0/norm1/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>61</dim>
					<dim>42</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model1/encoder/layers.0/norm1/Mul_output_0">
					<dim>1</dim>
					<dim>61</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="Constant_10158_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 42" offset="20190" size="84" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="Constant_10158" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>42</dim>
				</port>
			</input>
